Revit 2027 API
BuiltInFailures.PlanRegionFailures.InvalidPlanRegion Property
 Plan region is invalid. The sketch of a plan region may not contain intersecting, overlapping or nested loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidPlanRegion { get; }
Public Shared ReadOnly Property InvalidPlanRegion As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidPlanRegion {
	FailureDefinitionId^ get ();
}
static member InvalidPlanRegion : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PlanRegionFailures Class
Autodesk.Revit.DB Namespace